class CardRandomizer{

    get imagesAndTexts() {
        return [
            { image: 'images/cards/Ближній_бій.png', cover:"images/covers/Фіолетовий.png", text: 'Ця карта означає негайну необхідність діяти. Можливо Вам доведеться зіткнутися віч на віч з проблемою, яку ще ніхто не бачив.', index: 0},
            { image: 'images/cards/Піджак.png', cover:"images/covers/Синій.png", text: 'Ви здатні керувати ситуацією і мати вплив на інших. Необхідні обдумані дії та стратегічний підхід до рішень.', index: 1 },
            { image: 'images/cards/Дрономатка.png', cover:"images/covers/Зелений.png", text: 'Ця карта означає здатність піднятися вище, щоб побачити ширший контекст ситуації. Можливе використання технологій або механізмів для досягнення мети.', index: 2 },
            { image: 'images/cards/Голограма.png', cover:"images/covers/Жовтий.png", text: 'Чи бачите Ви справжню картину? Чи лише ілюзію... Істина може бути складнішою ніж здалось на перший погляд.', index: 3 },
            { image: 'images/cards/Кібервійна.png', cover:"images/covers/Червоний.png", text: 'Загроза або напруження, пов\'язані з кібернетичним середовищем або інформаційною безпекою.', index: 4 },
            { image: 'images/cards/Байт.png', cover:"images/covers/Бірюзовий.png", text: 'Ця карта може символізувати увагу до дрібних деталей, необхідність розглядати ситуацію на рівні байтів. Необхідно глибоко аналізувати інформацію для прийняття рішень.', index: 5 },
            { image: 'images/cards/VR.png', cover:"images/covers/Сірий.png", text: 'Відчуження від реальності, можливість експериментувати та відкривати нові можливості. Може вказувати на важливість уяви та спроможності побачити більше, ніж інші люди.', index: 6 },
            { image: 'images/cards/Вектор.png', cover:"images/covers/Помаранчевий.png", text: 'Ця карта символізує чітке направлення у діях або розвитку ситуації.', index: 7 },
            { image: 'images/cards/Кібермозок.png', cover:"images/covers/Рожевий.png", text: 'Ця карта вказує на здатність знаходити незвичайні шляхи розв\'язання проблем. Символізує інтелектуальну та технічну хитрість.', index: 8 },
            { image:'images/cards/Нанотехнологія.png', cover:"images/covers/Фіолетовий.png", text:"Ця карта може вказувати на мікроскопічні зміни або перетворення, які можуть мати великий вплив. Символізує здатність до інновацій та реформ, що можуть привести до значних змін у житті або оточуючому світі.", index:"9"},
            { image:'images/cards/Нейромережа.png', cover:"images/covers/Синій.png", text:"Ця карта може вказувати на потенціал розумового розвитку, використання інтуїції або підвищення свідомості. Символізує зв'язок із внутрішнім собою та здатність до адаптації та навчання.", index:"10"},
            { image:'images/cards/Мережник.png', cover:"images/covers/Зелений.png", text:"Ця карта може вказувати на особу, яка володіє великою кількістю зв'язків, ресурсів або інформації. Символізує комунікацію, співпрацю та можливість отримання підтримки або допомоги від інших.", index:"11"},
            { image:'images/cards/Шифрування.png', cover:"images/covers/Жовтий.png", text:"Ця карта символізує потребу у захисті конфіденційно важливої інформації. Можливо варто приховувати деякі деталі про себе.", index:"12"},
            { image:'images/cards/КіберРеволюція.png', cover:"images/covers/Червоний.png", text:"Ця карта може вказувати на радикальні зміни або перетворення, що відбуваються у цифровому або технологічному світі. Символізує пошук інноваційних рішень або відкриття нових шляхів розвитку.", index:"13"},
            { image:'images/cards/Хмара.png', cover:"images/covers/Бірюзовий.png", text:"Ця карта може вказувати на спільноту, підтримку або з'єднання з іншими людьми чи ресурсами. Символізує обмін інформацією або ресурсами через мережу, а також можливість доступу до небачених можливостей.", index:"14"},
            { image:'images/cards/Апгрейд.png', cover:"images/covers/Сірий.png", text:"Ця карта може вказувати на необхідність розвитку, вдосконалення або зміни, щоб досягти більш високого рівня ефективності або задоволення. Символізує потенціал для зростання та розвитку, а також відкриття нових можливостей.", index:"15"},
            { image:'images/cards/Матриця.png', cover:"images/covers/Помаранчевий.png", text:"Ця карта може вказувати на важливість структури, організації або системи у житті або проекті. Символізує взаємодію між елементами та можливість виявлення закономірностей у складному середовищі.", index:"16"},
            { image:'images/cards/Квантове_Серце.png', cover:"images/covers/Рожевий.png", text:"Ця карта може вказувати на з'єднання між раціональністю та емоціями, або на пошук глибинного розуміння себе та світу. Символізує внутрішній розвиток, духовне прозріння або здатність до відкриття глибоких істин.", index:"17"}
        ];
    }

    getRandomElement(removeIndexes) {
        if(removeIndexes == null){
            removeIndexes = [];
        }
        let remainingCards = this.imagesAndTexts.filter(card => !removeIndexes.includes(card.index));
        const randomIndex = Math.floor(Math.random() * remainingCards.length);
        return remainingCards[randomIndex];
    }
}